      $set ilusing(org.junit.jupiter.api) 
       class-id com.microfocus.cobol.function.TestOption public.

       working-storage section.

       method-id testLeftIdentity public final attribute Test.
       procedure division.
       end method.
       
       end class.
